.svn/pristine/17/17e57f5be29e6ca6246b09e032b3c1c612c93e91.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:b2b="http://www.apollomunichinsurance.com/B2BService" xmlns:prop="http://schemas.datacontract.org/2004/07/ProposalCaptureServiceLibrary" xmlns:ser="http://schemas.datacontract.org/2004/07/ServiceObjects">
   <soapenv:Header/>
   <soapenv:Body>
      <b2b:ProposalCapture>
         <!--Optional:-->
         <b2b:ProposalCaptureServiceRequest>
            <!--Optional:-->
            <prop:Action>Create</prop:Action>
            <!--Optional:-->
            <prop:Partner>
               <!--Optional:-->
               <ser:PartnerCode>___insurer_integration_agent_code___</ser:PartnerCode>
               <!--Optional:-->
               <ser:Password>___insurer_integration_service_password___</ser:Password>
               <!--Optional:-->
               <ser:UserName>___insurer_integration_service_user___</ser:UserName>
            </prop:Partner>
            <!--Optional:-->
            <prop:Prospect>
               <!--Optional:-->
               <ser:Application>
                  <!--Optional:-->
                  <ser:CrossSellCommonCode></ser:CrossSellCommonCode>
                  <!--Optional:-->
                  <ser:Namefor80D>Manish Anand</ser:Namefor80D>
                  <!--Optional:-->
                  <ser:NomineeAddress>
                     <!--Optional:-->
                     <ser:AddressLine1>sdfsdfsdf</ser:AddressLine1>
                     <!--Optional:-->
                     <ser:AddressLine2>sdfsdfsdf</ser:AddressLine2>
                     <!--Optional:-->
                     <ser:AddressLine3>sdfsdfsdf</ser:AddressLine3>
                     <!--Optional:-->
                     <ser:CountryCode>IN</ser:CountryCode>
                     <!--Optional:-->
                     <ser:District></ser:District>
                     <!--Optional:-->
                     <ser:PinCode>400070</ser:PinCode>
                     <!--Optional:-->
                     <ser:StateCode>021</ser:StateCode>
                     <!--Optional:-->
                     <ser:TownCode>3300</ser:TownCode>
                  </ser:NomineeAddress>
                  <!--Optional:-->
                  <ser:NomineeName>fghfg gfhfgh</ser:NomineeName>
                  <!--Optional:-->
                  <ser:NomineeTitleCode></ser:NomineeTitleCode>
                  <!--Optional:-->
                  <ser:Proposer>
                     <!--Optional:-->
                     <ser:Address>
                        <!--Zero or more repetitions:-->
                        <ser:Address>
                           <!--Optional:-->
                           <ser:AddressLine1>sdfsdfsdf</ser:AddressLine1>
                           <!--Optional:-->
                           <ser:AddressLine2>sdfsdfsdf</ser:AddressLine2>
                           <!--Optional:-->
                           <ser:AddressLine3>sdfsdfsdf</ser:AddressLine3>
                           <!--Optional:-->
                           <ser:CountryCode>IN</ser:CountryCode>
                           <!--Optional:-->
                           <ser:District></ser:District>
                           <!--Optional:-->
                           <ser:PinCode>400070</ser:PinCode>
                           <!--Optional:-->
                           <ser:StateCode>021</ser:StateCode>
                           <!--Optional:-->
                           <ser:TownCode>3300</ser:TownCode>
                        </ser:Address>
                     </ser:Address>
                     <!--Optional:-->
                     <ser:Age>___member_1_age___</ser:Age>
                     <!--Optional:-->
                     <ser:AnnualIncome>___annual_income___</ser:AnnualIncome>
                     <!--Optional:-->
                     <!--<ser:BirthDate>1989-06-01T16:02:53.1815488+05:30</ser:BirthDate>:-->
                     <ser:BirthDate>___birth_date___</ser:BirthDate>
                     <!--Optional:-->
                     <ser:ClientCode>PolicyHolder</ser:ClientCode>
                     <!--Optional:-->
                     <ser:ContactInformation>
                        <!--Optional:-->
                        <ser:ContactNumber>
                           <!--Zero or more repetitions:-->
                           <ser:ContactNumber>
                              <!--Optional:-->
                              <ser:Number>___mobile___</ser:Number>
                              <!--Optional:-->
                              <ser:Type>7</ser:Type>
                           </ser:ContactNumber>
                        </ser:ContactNumber>
                        <!--Optional:-->
                        <ser:Email>___email___</ser:Email>
                     </ser:ContactInformation>
                <ser:Dependants>
                    <!--InsurersDetail_Start-->
                    <ser:Client>
                        <ser:Address>
                            <ser:Address>
                                <ser:AddressLine1>sdfsdfsdf</ser:AddressLine1>
                                <ser:AddressLine2>sdfsdfs</ser:AddressLine2>
                                <ser:AddressLine3>dfsdfsdfsdf</ser:AddressLine3>
                                <ser:CountryCode>IN</ser:CountryCode>
                                <ser:PinCode>400070</ser:PinCode>
                                <ser:StateCode>021</ser:StateCode>
                                <ser:TownCode>3300</ser:TownCode>
                            </ser:Address>
                        </ser:Address>
                        <ser:Age>___member_array_age___</ser:Age>
                        <ser:AnnualIncome>0</ser:AnnualIncome>
                        <ser:BirthDate>___member_array_birth_date___</ser:BirthDate>
                        <ser:ClientCode>Member ___member_array_inc___</ser:ClientCode>
                        <ser:ContactInformation>
                            <ser:ContactNumber>
                                <ser:ContactNumber>
                                    <ser:Number>9798192992</ser:Number>
                                    <ser:Type>7</ser:Type>
                                </ser:ContactNumber>
                            </ser:ContactNumber>
                            <ser:Email>anand.manish92@gmail.com</ser:Email>
                        </ser:ContactInformation>
                        <ser:FamilySize>0</ser:FamilySize>
                        <ser:FirstName>sdfsdf</ser:FirstName>
                        <ser:GenderCode>2</ser:GenderCode>
                        <ser:Height>177</ser:Height>
                        <ser:IDProofNumber />
                        <ser:IDProofTypeCode />
                        <ser:LastName>sdfsdf</ser:LastName>
                        <ser:LifeStyleHabits>
                            <ser:BeerBottle>0</ser:BeerBottle>
                            <ser:LiquorPeg>0</ser:LiquorPeg>
                            <ser:Pouches>0</ser:Pouches>
                            <ser:Smoking>0</ser:Smoking>
                            <ser:WineGlass>0</ser:WineGlass>
                        </ser:LifeStyleHabits>
                        <ser:MaritalStatusCode>1</ser:MaritalStatusCode>
                        <ser:MiddleName>sdfsdf</ser:MiddleName>
                        <ser:NationalityCode>IN</ser:NationalityCode>
                        <ser:OccuptionCode>false</ser:OccuptionCode>
                        <ser:Product>
                            <ser:Product>
                                <ser:BasePremiumAmount>0</ser:BasePremiumAmount>
                                <ser:CBAmount>0</ser:CBAmount>
                                <ser:ClientCode>Member 1</ser:ClientCode>
                                <ser:DiscountAmount>0</ser:DiscountAmount>
                                <ser:GrossPremiumAmount>0</ser:GrossPremiumAmount>
                                <ser:LoadingAmount>0</ser:LoadingAmount>
                                <ser:PaidBy>0</ser:PaidBy>
                                <ser:ProductCode>11054</ser:ProductCode>
                                <ser:ProductGroup>1</ser:ProductGroup>
                                <ser:ProductLine>2</ser:ProductLine>
                                <ser:ProductType>1</ser:ProductType>
                                <ser:ProductVersion>1</ser:ProductVersion>
                                <ser:SACCode>0</ser:SACCode>
                                <ser:SumAssured>0</ser:SumAssured>
                                <ser:TaxAmount>0</ser:TaxAmount>
                            </ser:Product>
                        </ser:Product>
                        <ser:RelationshipCode>14</ser:RelationshipCode>
                        <ser:SmokerFlag>false</ser:SmokerFlag>
                        <ser:TitleCode>___member_array_salutation___</ser:TitleCode>
                        <ser:TotalPremium>0</ser:TotalPremium>
                        <ser:Weight>60</ser:Weight>
                    </ser:Client>
                    <!--InsurersDetail_End-->
                </ser:Dependants>
                <ser:FamilySize>2</ser:FamilySize>
                <ser:FirstName>Manish</ser:FirstName>
                <ser:GenderCode>1</ser:GenderCode>
                <ser:GstinNumber>12ASLPB1234M4Z1</ser:GstinNumber>
                <ser:Height>170</ser:Height>
                <ser:IDProofNumber />
                <ser:IDProofTypeCode />
                <ser:LastName>Anand</ser:LastName>
                <ser:MaritalStatusCode>1</ser:MaritalStatusCode>
                <ser:MiddleName>sdfsdfsdf</ser:MiddleName>
                <ser:NationalityCode>IN</ser:NationalityCode>
                <ser:OccuptionCode>false</ser:OccuptionCode>
                <ser:Product>
                    <ser:Product>
                        <ser:BasePremiumAmount>6859.00</ser:BasePremiumAmount>
                        <ser:CBAmount>0</ser:CBAmount>
                        <ser:ClientCode>PolicyHolder</ser:ClientCode>
                        <ser:DiscountAmount>0</ser:DiscountAmount>
                        <ser:GrossPremiumAmount>8093.62</ser:GrossPremiumAmount>
                        <ser:LoadingAmount>0</ser:LoadingAmount>
                        <ser:PaidBy>0</ser:PaidBy>
                        <ser:ProductCode>11054</ser:ProductCode>
                        <ser:ProductGroup>1</ser:ProductGroup>
                        <ser:ProductLine>2</ser:ProductLine>
                        <ser:ProductType>1</ser:ProductType>
                        <ser:ProductVersion>1</ser:ProductVersion>
                        <ser:SACCode>0</ser:SACCode>
                        <ser:SumAssured>300000</ser:SumAssured>
                        <ser:TaxAmount>1234.62</ser:TaxAmount>
                    </ser:Product>
                </ser:Product>
                <ser:RelationshipCode>1</ser:RelationshipCode>
                <ser:SmokerFlag>false</ser:SmokerFlag>
                <ser:TitleCode>MR</ser:TitleCode>
                <ser:TotalPremium>0</ser:TotalPremium>
                <ser:Weight>60</ser:Weight>
            </ser:Proposer>
            <ser:RelationToNomineeCode>17</ser:RelationToNomineeCode>
            <ser:RelationToSponsorCode>0</ser:RelationToSponsorCode>
            <ser:RuralFlag>1</ser:RuralFlag>
            <ser:TPANameCode>FHPL</ser:TPANameCode>
        </ser:Application>
        <ser:BrandCode>ApolloMunich</ser:BrandCode>
        <ser:Client>
            <ser:Address>
                <ser:Address>
                    <ser:AddressLine1>sdfsdfsdf</ser:AddressLine1>
                    <ser:AddressLine2>sdfsdfs</ser:AddressLine2>
                    <ser:AddressLine3>dfsdfsdfsdf</ser:AddressLine3>
                    <ser:CountryCode>IN</ser:CountryCode>
                    <ser:PinCode>400070</ser:PinCode>
                    <ser:StateCode>021</ser:StateCode>
                    <ser:TownCode>3300</ser:TownCode>
                </ser:Address>
            </ser:Address>
            <ser:Age>___member_1_age___</ser:Age>
            <ser:AnnualIncome>___annual_income___</ser:AnnualIncome>
            <ser:BirthDate>1989-06-01T16:02:53.1815488+05:30</ser:BirthDate>
            <ser:ClientCode>PolicyHolder</ser:ClientCode>
            <ser:ContactInformation>
                <ser:ContactNumber>
                    <ser:ContactNumber>
                        <ser:Number>9798192992</ser:Number>
                        <ser:Type>7</ser:Type>
                    </ser:ContactNumber>
                </ser:ContactNumber>
                <ser:Email>anand.manish92@gmail.com</ser:Email>
            </ser:ContactInformation>
            <ser:Dependants>
                <!--InsurersDetail_Start-->
                <ser:Client>
                    <ser:Address>
                        <ser:Address>
                            <ser:AddressLine1>sdfsdfsdf</ser:AddressLine1>
                            <ser:AddressLine2>sdfsdfs</ser:AddressLine2>
                            <ser:AddressLine3>dfsdfsdfsdf</ser:AddressLine3>
                            <ser:CountryCode>IN</ser:CountryCode>
                            <ser:PinCode>400070</ser:PinCode>
                            <ser:StateCode>021</ser:StateCode>
                            <ser:TownCode>3300</ser:TownCode>
                        </ser:Address>
                    </ser:Address>
                    <ser:Age>___member_array_age___</ser:Age>
                    <ser:AnnualIncome>0</ser:AnnualIncome>
                    <ser:BirthDate>___member_array_birth_date___</ser:BirthDate>
                    <ser:ClientCode>Member ___member_array_inc___</ser:ClientCode>
                    <ser:ContactInformation>
                        <ser:ContactNumber>
                            <ser:ContactNumber>
                                <ser:Number>9798192992</ser:Number>
                                <ser:Type>7</ser:Type>
                            </ser:ContactNumber>
                        </ser:ContactNumber>
                        <ser:Email>anand.manish92@gmail.com</ser:Email>
                    </ser:ContactInformation>
                    <ser:FamilySize>0</ser:FamilySize>
                    <ser:FirstName>sdfsdf</ser:FirstName>
                    <ser:GenderCode>2</ser:GenderCode>
                    <ser:Height>177</ser:Height>
                    <ser:IDProofNumber />
                    <ser:IDProofTypeCode />
                    <ser:LastName>sdfsdf</ser:LastName>
                    <ser:LifeStyleHabits>
                        <ser:BeerBottle>0</ser:BeerBottle>
                        <ser:LiquorPeg>0</ser:LiquorPeg>
                        <ser:Pouches>0</ser:Pouches>
                        <ser:Smoking>0</ser:Smoking>
                        <ser:WineGlass>0</ser:WineGlass>
                    </ser:LifeStyleHabits>
                    <ser:MaritalStatusCode>2</ser:MaritalStatusCode>
                    <ser:MiddleName>sdfsdf</ser:MiddleName>
                    <ser:NationalityCode>IN</ser:NationalityCode>
                    <ser:OccuptionCode>false</ser:OccuptionCode>
                    <ser:Product>
                        <ser:Product>
                            <ser:BasePremiumAmount>0</ser:BasePremiumAmount>
                            <ser:CBAmount>0</ser:CBAmount>
                            <ser:ClientCode>Member 1</ser:ClientCode>
                            <ser:DiscountAmount>0</ser:DiscountAmount>
                            <ser:GrossPremiumAmount>0</ser:GrossPremiumAmount>
                            <ser:LoadingAmount>0</ser:LoadingAmount>
                            <ser:PaidBy>0</ser:PaidBy>
                            <ser:ProductCode>11054</ser:ProductCode>
                            <ser:ProductGroup>1</ser:ProductGroup>
                            <ser:ProductLine>2</ser:ProductLine>
                            <ser:ProductType>1</ser:ProductType>
                            <ser:ProductVersion>1</ser:ProductVersion>
                            <ser:SACCode>0</ser:SACCode>
                            <ser:SumAssured>0</ser:SumAssured>
                            <ser:TaxAmount>0</ser:TaxAmount>
                        </ser:Product>
                    </ser:Product>
                    <ser:RelationshipCode>2</ser:RelationshipCode>
                    <ser:SmokerFlag>false</ser:SmokerFlag>
                    <ser:TitleCode>MR</ser:TitleCode>
                    <ser:TotalPremium>0</ser:TotalPremium>
                    <ser:Weight>60</ser:Weight>
                </ser:Client>
                <!--InsurersDetail_End-->
            </ser:Dependants>
            <ser:FamilySize>2</ser:FamilySize>
            <ser:FirstName>Manish</ser:FirstName>
            <ser:GenderCode>1</ser:GenderCode>
            <ser:GstinNumber>12ASLPB1234M4Z1</ser:GstinNumber>
            <ser:Height>170</ser:Height>
            <ser:IDProofNumber />
            <ser:IDProofTypeCode />
            <ser:LastName>Anand</ser:LastName>
            <ser:MaritalStatusCode>1</ser:MaritalStatusCode>
            <ser:MiddleName>sdfsdfsdf</ser:MiddleName>
            <ser:NationalityCode>IN</ser:NationalityCode>
            <ser:OccuptionCode>false</ser:OccuptionCode>
            <ser:Product>
                <ser:Product>
                    <ser:BasePremiumAmount>6859.00</ser:BasePremiumAmount>
                    <ser:CBAmount>0</ser:CBAmount>
                    <ser:ClientCode>PolicyHolder</ser:ClientCode>
                    <ser:DiscountAmount>0</ser:DiscountAmount>
                    <ser:GrossPremiumAmount>8093.62</ser:GrossPremiumAmount>
                    <ser:LoadingAmount>0</ser:LoadingAmount>
                    <ser:PaidBy>0</ser:PaidBy>
                    <ser:ProductCode>11054</ser:ProductCode>
                    <ser:ProductGroup>1</ser:ProductGroup>
                    <ser:ProductLine>2</ser:ProductLine>
                    <ser:ProductType>1</ser:ProductType>
                    <ser:ProductVersion>1</ser:ProductVersion>
                    <ser:SACCode>0</ser:SACCode>
                    <ser:SumAssured>300000</ser:SumAssured>
                    <ser:TaxAmount>1234.62</ser:TaxAmount>
                </ser:Product>
            </ser:Product>
            <ser:RelationshipCode>1</ser:RelationshipCode>
            <ser:SmokerFlag>false</ser:SmokerFlag>
            <ser:TitleCode>MR</ser:TitleCode>
            <ser:TotalPremium>0</ser:TotalPremium>
            <ser:Weight>60</ser:Weight>
        </ser:Client>
        <ser:MedicalInformations />
        <ser:PolicyType>0</ser:PolicyType>
        <ser:StartDate>___policy_start_date___</ser:StartDate>
        <ser:TotalPremiumAmount>8093.62</ser:TotalPremiumAmount>
 </prop:Prospect>
         </b2b:ProposalCaptureServiceRequest>
      </b2b:ProposalCapture>
   </soapenv:Body>
</soapenv:Envelope>